## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_role_definition.custom_roles
* Delete
  * azurerm_role_definition.custom_roles[&#34;Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/CFT-Sandbox&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_definition.custom_roles will be created
  + resource "azurerm_role_definition" "custom_roles" {
      + assignable_scopes           = [
          + "/providers/Microsoft.Management/managementGroups/Platform-Prod",
        ]
      + description                 = "Read and Resource Delete Access to applicably assigned scope"
      + id                          = (known after apply)
      + name                        = "Orphan Resource Cleanup Read/Delete"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"

      + permissions {
          + actions     = [
              + "*/read",
              + "Microsoft.Resources/*/delete",
            ]
          + not_actions = []
        }
    }

  # azurerm_role_definition.custom_roles["Orphan Resource Cleanup Read/Delete-/providers/Microsoft.Management/managementGroups/CFT-Sandbox"] will be destroyed
  # (because resource does not use for_each)
  - resource "azurerm_role_definition" "custom_roles" {
      - assignable_scopes           = [
          - "/providers/Microsoft.Management/managementGroups/CFT-Sandbox",
        ] -> null
      - description                 = "Read and Resource Delete Access to applicably assigned scope" -> null
      - id                          = "/providers/Microsoft.Authorization/roleDefinitions/b9a66553-f1d2-be14-3341-3670e643c755|/providers/Microsoft.Management/managementGroups/CFT-Sandbox" -> null
      - name                        = "Orphan Resource Cleanup Read/Delete" -> null
      - role_definition_id          = "b9a66553-f1d2-be14-3341-3670e643c755" -> null
      - role_definition_resource_id = "/providers/Microsoft.Authorization/roleDefinitions/b9a66553-f1d2-be14-3341-3670e643c755" -> null
      - scope                       = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox" -> null

      - permissions {
          - actions          = [
              - "*/read",
              - "Microsoft.Resources/*/delete",
            ] -> null
          - data_actions     = [] -> null
          - not_actions      = [] -> null
          - not_data_actions = [] -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->